; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	image0 - mode
	thermograph2 - mode
	image1 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	Star2 - direction
	Star3 - direction
	Phenomenon4 - direction
	Planet5 - direction
	Planet6 - direction
	Star7 - direction
	Star8 - direction
	Phenomenon9 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star2)
	(supports instrument1 thermograph2)
	(calibration_target instrument1 Star2)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star2)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 167)
	(supports instrument3 image0)
	(supports instrument3 image1)
	(supports instrument3 thermograph2)
	(calibration_target instrument3 GroundStation0)
	(supports instrument4 image1)
	(supports instrument4 image0)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star3)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 119)
	(supports instrument5 thermograph2)
	(supports instrument5 image0)
	(supports instrument5 image1)
	(calibration_target instrument5 GroundStation0)
	(supports instrument6 thermograph2)
	(supports instrument6 image0)
	(calibration_target instrument6 GroundStation1)
	(supports instrument7 image1)
	(supports instrument7 thermograph2)
	(supports instrument7 image0)
	(calibration_target instrument7 Star2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star8)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 136)
	(= (data Star3 image0) 100)
	(= (data Phenomenon4 image0) 213)
	(= (data Planet5 image0) 236)
	(= (data Planet6 image0) 63)
	(= (data Star7 image0) 78)
	(= (data Star8 image0) 105)
	(= (data Phenomenon9 image0) 125)
	(= (data Star3 thermograph2) 219)
	(= (data Phenomenon4 thermograph2) 273)
	(= (data Planet5 thermograph2) 157)
	(= (data Planet6 thermograph2) 151)
	(= (data Star7 thermograph2) 12)
	(= (data Star8 thermograph2) 3)
	(= (data Phenomenon9 thermograph2) 120)
	(= (data Star3 image1) 233)
	(= (data Phenomenon4 image1) 208)
	(= (data Planet5 image1) 197)
	(= (data Planet6 image1) 159)
	(= (data Star7 image1) 282)
	(= (data Star8 image1) 199)
	(= (data Phenomenon9 image1) 263)
	(= (slew_time GroundStation1 GroundStation0) 13.97)
	(= (slew_time GroundStation0 GroundStation1) 13.97)
	(= (slew_time Star2 GroundStation0) 25.91)
	(= (slew_time GroundStation0 Star2) 25.91)
	(= (slew_time Star2 GroundStation1) 34.09)
	(= (slew_time GroundStation1 Star2) 34.09)
	(= (slew_time Star3 GroundStation0) 31.85)
	(= (slew_time GroundStation0 Star3) 31.85)
	(= (slew_time Star3 GroundStation1) 77.3)
	(= (slew_time GroundStation1 Star3) 77.3)
	(= (slew_time Star3 Star2) 36.52)
	(= (slew_time Star2 Star3) 36.52)
	(= (slew_time Phenomenon4 GroundStation0) 35.32)
	(= (slew_time GroundStation0 Phenomenon4) 35.32)
	(= (slew_time Phenomenon4 GroundStation1) 18.02)
	(= (slew_time GroundStation1 Phenomenon4) 18.02)
	(= (slew_time Phenomenon4 Star2) 4.16)
	(= (slew_time Star2 Phenomenon4) 4.16)
	(= (slew_time Phenomenon4 Star3) 58.38)
	(= (slew_time Star3 Phenomenon4) 58.38)
	(= (slew_time Planet5 GroundStation0) 35.66)
	(= (slew_time GroundStation0 Planet5) 35.66)
	(= (slew_time Planet5 GroundStation1) 22.83)
	(= (slew_time GroundStation1 Planet5) 22.83)
	(= (slew_time Planet5 Star2) 23.74)
	(= (slew_time Star2 Planet5) 23.74)
	(= (slew_time Planet5 Star3) 58.34)
	(= (slew_time Star3 Planet5) 58.34)
	(= (slew_time Planet5 Phenomenon4) 54.66)
	(= (slew_time Phenomenon4 Planet5) 54.66)
	(= (slew_time Planet6 GroundStation0) 13.86)
	(= (slew_time GroundStation0 Planet6) 13.86)
	(= (slew_time Planet6 GroundStation1) 23.35)
	(= (slew_time GroundStation1 Planet6) 23.35)
	(= (slew_time Planet6 Star2) 81.33)
	(= (slew_time Star2 Planet6) 81.33)
	(= (slew_time Planet6 Star3) 43.6)
	(= (slew_time Star3 Planet6) 43.6)
	(= (slew_time Planet6 Phenomenon4) 2.141)
	(= (slew_time Phenomenon4 Planet6) 2.141)
	(= (slew_time Planet6 Planet5) 22.68)
	(= (slew_time Planet5 Planet6) 22.68)
	(= (slew_time Star7 GroundStation0) 31.97)
	(= (slew_time GroundStation0 Star7) 31.97)
	(= (slew_time Star7 GroundStation1) 5.745)
	(= (slew_time GroundStation1 Star7) 5.745)
	(= (slew_time Star7 Star2) 9.09)
	(= (slew_time Star2 Star7) 9.09)
	(= (slew_time Star7 Star3) 30.99)
	(= (slew_time Star3 Star7) 30.99)
	(= (slew_time Star7 Phenomenon4) 3.889)
	(= (slew_time Phenomenon4 Star7) 3.889)
	(= (slew_time Star7 Planet5) 7.721)
	(= (slew_time Planet5 Star7) 7.721)
	(= (slew_time Star7 Planet6) 57.73)
	(= (slew_time Planet6 Star7) 57.73)
	(= (slew_time Star8 GroundStation0) 59.09)
	(= (slew_time GroundStation0 Star8) 59.09)
	(= (slew_time Star8 GroundStation1) 24.78)
	(= (slew_time GroundStation1 Star8) 24.78)
	(= (slew_time Star8 Star2) 57.64)
	(= (slew_time Star2 Star8) 57.64)
	(= (slew_time Star8 Star3) 88.76)
	(= (slew_time Star3 Star8) 88.76)
	(= (slew_time Star8 Phenomenon4) 12.94)
	(= (slew_time Phenomenon4 Star8) 12.94)
	(= (slew_time Star8 Planet5) 6.433)
	(= (slew_time Planet5 Star8) 6.433)
	(= (slew_time Star8 Planet6) 12.52)
	(= (slew_time Planet6 Star8) 12.52)
	(= (slew_time Star8 Star7) 33.69)
	(= (slew_time Star7 Star8) 33.69)
	(= (slew_time Phenomenon9 GroundStation0) 28.55)
	(= (slew_time GroundStation0 Phenomenon9) 28.55)
	(= (slew_time Phenomenon9 GroundStation1) 75.4)
	(= (slew_time GroundStation1 Phenomenon9) 75.4)
	(= (slew_time Phenomenon9 Star2) 56.41)
	(= (slew_time Star2 Phenomenon9) 56.41)
	(= (slew_time Phenomenon9 Star3) 17.1)
	(= (slew_time Star3 Phenomenon9) 17.1)
	(= (slew_time Phenomenon9 Phenomenon4) 2.346)
	(= (slew_time Phenomenon4 Phenomenon9) 2.346)
	(= (slew_time Phenomenon9 Planet5) 7.42)
	(= (slew_time Planet5 Phenomenon9) 7.42)
	(= (slew_time Phenomenon9 Planet6) 46.91)
	(= (slew_time Planet6 Phenomenon9) 46.91)
	(= (slew_time Phenomenon9 Star7) 36.83)
	(= (slew_time Star7 Phenomenon9) 36.83)
	(= (slew_time Phenomenon9 Star8) 30.68)
	(= (slew_time Star8 Phenomenon9) 30.68)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite1 Star8)
	(have_image Phenomenon4 image0)
	(have_image Planet5 thermograph2)
	(have_image Planet6 image1)
	(have_image Star7 image0)
	(have_image Star8 thermograph2)
	(have_image Phenomenon9 image1)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite1 phenomenon9 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 phenomenon9)
   changed: (fuel satellite1) from 119 to 101.9, (fuel-used) from 0 to 17.1
   goals met: 0 of 7
2. (turn_to satellite0 planet5 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 167 to 143.26, (fuel-used) from 17.1 to 40.84
   goals met: 0 of 7
3. (turn_to satellite1 phenomenon4 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 101.9 to 99.554, (fuel-used) from 40.84 to 43.186
   goals met: 0 of 7
4. (turn_to satellite0 phenomenon9 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 phenomenon9)
   changed: (fuel satellite0) from 143.26 to 135.84, (fuel-used) from 43.186 to 50.606
   goals met: 0 of 7
5. (switch_on instrument4 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument4)
   goals met: 0 of 7
6. (turn_to satellite1 groundstation1 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 groundstation1)
   changed: (fuel satellite1) from 99.554 to 81.534, (fuel-used) from 50.606 to 68.626
   goals met: 0 of 7
7. (calibrate satellite1 instrument4 groundstation1)
   added: (calibrated instrument4)
   goals met: 0 of 7
8. (turn_to satellite1 phenomenon4 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 81.534 to 63.514, (fuel-used) from 68.626 to 86.646
   goals met: 0 of 7
9. (turn_to satellite1 planet6 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 planet6)
   changed: (fuel satellite1) from 63.514 to 61.373, (fuel-used) from 86.646 to 88.787
   goals met: 0 of 7
10. (take_image satellite1 planet6 instrument4 image1)
   added: (have_image planet6 image1)
   changed: (data_capacity satellite1) from 1000 to 841, (data-stored) from 0 to 159
   goals met: 1 of 7
11. (turn_to satellite1 phenomenon4 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 61.373 to 59.232, (fuel-used) from 88.787 to 90.928
   goals met: 1 of 7
12. (turn_to satellite0 planet5 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 135.84 to 128.42, (fuel-used) from 90.928 to 98.348
   goals met: 1 of 7
13. (turn_to satellite0 phenomenon9 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 phenomenon9)
   changed: (fuel satellite0) from 128.42 to 121, (fuel-used) from 98.348 to 105.768
   goals met: 1 of 7
14. (turn_to satellite0 planet5 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 121 to 113.58, (fuel-used) from 105.768 to 113.188
   goals met: 1 of 7
15. (take_image satellite1 phenomenon4 instrument4 image0)
   added: (have_image phenomenon4 image0)
   changed: (data_capacity satellite1) from 841 to 628, (data-stored) from 159 to 372
   goals met: 2 of 7
16. (turn_to satellite1 phenomenon9 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 phenomenon9)
   changed: (fuel satellite1) from 59.232 to 56.886, (fuel-used) from 113.188 to 115.534
   goals met: 2 of 7
17. (turn_to satellite1 phenomenon4 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon4)
   changed: (fuel satellite1) from 56.886 to 54.54, (fuel-used) from 115.534 to 117.88
   goals met: 2 of 7
18. (turn_to satellite0 phenomenon9 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 phenomenon9)
   changed: (fuel satellite0) from 113.58 to 106.16, (fuel-used) from 117.88 to 125.3
   goals met: 2 of 7
19. (turn_to satellite0 planet5 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 106.16 to 98.74, (fuel-used) from 125.3 to 132.72
   goals met: 2 of 7
20. (turn_to satellite0 phenomenon9 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 phenomenon9)
   changed: (fuel satellite0) from 98.74 to 91.32, (fuel-used) from 132.72 to 140.14
   goals met: 2 of 7
21. (turn_to satellite0 planet5 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 91.32 to 83.9, (fuel-used) from 140.14 to 147.56
   goals met: 2 of 7
22. (turn_to satellite0 phenomenon9 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 phenomenon9)
   changed: (fuel satellite0) from 83.9 to 76.48, (fuel-used) from 147.56 to 154.98
   goals met: 2 of 7
23. (turn_to satellite0 planet5 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet5)
   changed: (fuel satellite0) from 76.48 to 69.06, (fuel-used) from 154.98 to 162.4
   goals met: 2 of 7
24. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 2 of 7
25. (turn_to satellite1 phenomenon9 phenomenon4)
   deleted: (pointing satellite1 phenomenon4)
   added: (pointing satellite1 phenomenon9)
   changed: (fuel satellite1) from 54.54 to 52.194, (fuel-used) from 162.4 to 164.746
   goals met: 2 of 7
26. (take_image satellite1 phenomenon9 instrument4 image1)
   added: (have_image phenomenon9 image1)
   changed: (data_capacity satellite1) from 628 to 365, (data-stored) from 372 to 635
   goals met: 3 of 7
27. (turn_to satellite1 star7 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 star7)
   changed: (fuel satellite1) from 52.194 to 15.364, (fuel-used) from 164.746 to 201.576
   goals met: 3 of 7
28. (take_image satellite1 star7 instrument4 image0)
   added: (have_image star7 image0)
   changed: (data_capacity satellite1) from 365 to 287, (data-stored) from 635 to 713
   goals met: 4 of 7
29. (turn_to satellite1 planet5 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 planet5)
   changed: (fuel satellite1) from 15.364 to 7.643, (fuel-used) from 201.576 to 209.297
   goals met: 4 of 7
30. (turn_to satellite1 star8 planet5)
   deleted: (pointing satellite1 planet5)
   added: (pointing satellite1 star8)
   changed: (fuel satellite1) from 7.643 to 1.21, (fuel-used) from 209.297 to 215.73
   goals met: 5 of 7
31. (turn_to satellite0 star8 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 star8)
   changed: (fuel satellite0) from 69.06 to 62.627, (fuel-used) from 215.73 to 222.163
   goals met: 5 of 7
32. (turn_to satellite0 star2 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star2)
   changed: (fuel satellite0) from 62.627 to 4.987, (fuel-used) from 222.163 to 279.803
   goals met: 5 of 7
33. (turn_to satellite2 planet5 star8)
   deleted: (pointing satellite2 star8)
   added: (pointing satellite2 planet5)
   changed: (fuel satellite2) from 136 to 129.567, (fuel-used) from 279.803 to 286.236
   goals met: 5 of 7
34. (turn_to satellite2 star7 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 star7)
   changed: (fuel satellite2) from 129.567 to 121.846, (fuel-used) from 286.236 to 293.957
   goals met: 5 of 7
35. (turn_to satellite2 planet5 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 planet5)
   changed: (fuel satellite2) from 121.846 to 114.125, (fuel-used) from 293.957 to 301.678
   goals met: 5 of 7
36. (turn_to satellite2 star7 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 star7)
   changed: (fuel satellite2) from 114.125 to 106.404, (fuel-used) from 301.678 to 309.399
   goals met: 5 of 7
37. (turn_to satellite2 planet5 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 planet5)
   changed: (fuel satellite2) from 106.404 to 98.683, (fuel-used) from 309.399 to 317.12
   goals met: 5 of 7
38. (turn_to satellite2 star7 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 star7)
   changed: (fuel satellite2) from 98.683 to 90.962, (fuel-used) from 317.12 to 324.841
   goals met: 5 of 7
39. (turn_to satellite2 planet5 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 planet5)
   changed: (fuel satellite2) from 90.962 to 83.241, (fuel-used) from 324.841 to 332.562
   goals met: 5 of 7
40. (turn_to satellite2 groundstation1 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 groundstation1)
   changed: (fuel satellite2) from 83.241 to 60.411, (fuel-used) from 332.562 to 355.392
   goals met: 5 of 7
41. (turn_to satellite2 star7 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 star7)
   changed: (fuel satellite2) from 60.411 to 54.666, (fuel-used) from 355.392 to 361.137
   goals met: 5 of 7
42. (turn_to satellite2 planet5 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 planet5)
   changed: (fuel satellite2) from 54.666 to 46.945, (fuel-used) from 361.137 to 368.858
   goals met: 5 of 7
43. (switch_on instrument6 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument6)
   goals met: 5 of 7
44. (turn_to satellite2 groundstation1 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 groundstation1)
   changed: (fuel satellite2) from 46.945 to 24.115, (fuel-used) from 368.858 to 391.688
   goals met: 5 of 7
45. (calibrate satellite2 instrument6 groundstation1)
   added: (calibrated instrument6)
   goals met: 5 of 7
46. (turn_to satellite2 star7 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 star7)
   changed: (fuel satellite2) from 24.115 to 18.37, (fuel-used) from 391.688 to 397.433
   goals met: 5 of 7
47. (turn_to satellite2 planet5 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 planet5)
   changed: (fuel satellite2) from 18.37 to 10.649, (fuel-used) from 397.433 to 405.154
   goals met: 5 of 7
48. (take_image satellite2 planet5 instrument6 thermograph2)
   added: (have_image planet5 thermograph2)
   changed: (data_capacity satellite2) from 1000 to 843, (data-stored) from 713 to 870
   goals met: 6 of 7
49. (turn_to satellite2 star8 planet5)
   deleted: (pointing satellite2 planet5)
   added: (pointing satellite2 star8)
   changed: (fuel satellite2) from 10.649 to 4.216, (fuel-used) from 405.154 to 411.587
   goals met: 6 of 7
50. (take_image satellite2 star8 instrument6 thermograph2)
   added: (have_image star8 thermograph2)
   changed: (data_capacity satellite2) from 843 to 840, (data-stored) from 870 to 873
   goals met: 7 of 7
